texts = {
  "url": {
    "nmap": "https://telegra.ph/Nmap-manual-11-19",
    "hydra": "https://telegra.ph/Hydra-manual-11-19",
    "searchsploit": "https://telegra.ph/Searchsploit-manual-11-19",
    "msfconsole": "https://telegra.ph/MSFconsole-11-19",
    "sqlmap": "https://telegra.ph/SQLMap-Manual-11-19",
    "ncrack": "https://telegra.ph/Ncrack-manual-11-19",
  },
  "preview": {
    "nmap": "Nmap (Network Mapper) — это мощный инструмент для сетевого сканирования,\nкоторый используется для обнаружения хостов и служб в сети. В Kali Linux Nmap\nуже предустановлен, поэтому вам не нужно его устанавливать.",
    "hydra": "Hydra — это мощный инструмент для брутфорса (перебора паролей) различных\nсетевых протоколов. Он поддерживает множество протоколов, включая HTTP,\nFTP, SSH, Telnet и другие. В Kali Linux Hydra уже предустановлен, поэтому вам не\nнужно его устанавливать.",
    "searchsploit": "Searchsploit - это инструмент, входящий в состав Exploit Database (EDB),\nкоторый позволяет искать эксплойты и патчи для различных уязвимостей в\nоперационных системах, программном обеспечении и устройствах. В Kali Linux\nSearchsploit уже предустановлен, поэтому вам не нужно его устанавливать.",
    "msfconsole": "MSFconsole - это мощный инструмент для проведения эксплуатации\nуязвимостей и управления атаками в сетевых системах. Он является частью\nMetasploit Framework, который предоставляет множество модулей для\nразличных типов атак. В Kali Linux MSFconsole уже предустановлен, поэтому вам\nне нужно его устанавливать.",
    "sqlmap": "SQLMap - это мощный инструмент для автоматизации тестирования на SQL-\nинъекции, который позволяет обнаруживать, эксплуатировать и даже\nавтоматизировать эксплуатацию уязвимостей SQL-инъекций. В Kali Linux\nSQLMap уже предустановлен, поэтому вам не нужно его устанавливать.",
    "ncrack": "Ncrack - это высокоскоростной инструмент для перебора паролей, который\nиспользуется для аутентификации в различных сетевых протоколах. Он\nподдерживает широкий спектр протоколов, включая SSH, RDP, FTP, Telnet и\nдругие. В Kali Linux Ncrack уже предустановлен, поэтому вам не нужно его\nустанавливать.",
  }

}